# FindAllEdgeEndPointsAtVertex Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SolidUtils..::..FindAllEdgeEndPointsAtVertex Method
SolidUtils Class See Also
---
Find all EdgeEndPoints at a vertex identified by the input EdgeEndPoint.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static IList<EdgeEndPoint> FindAllEdgeEndPointsAtVertex(
	EdgeEndPoint edgeEndPoint
)
```

Visual Basic
---
```text
Public Shared Function FindAllEdgeEndPointsAtVertex ( _
	edgeEndPoint As EdgeEndPoint _
) As IList(Of EdgeEndPoint)
```

Visual C++
---
```text
public:
static IList<EdgeEndPoint^>^ FindAllEdgeEndPointsAtVertex(
	EdgeEndPoint^ edgeEndPoint
)
```

# ### Parameters
edgeEndPoint
    Type: Autodesk.Revit.DB..::..EdgeEndPoint The input EdgeEndPoint that identifies the vertex.
# ### Return Value
All EdgeEndPoints at the vertex. The input EdgeEndPoint is also included.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Failed to find all EdgeEndPoints at a vertex identified by the input EdgeEndPoint. |

# See Also
SolidUtils Class
Autodesk.Revit.DB Namespace